In [2]:
import pandas as pd
import numpy as py

In [3]:
import os
os.getcwd()

'C:\\Users\\D-TECH\\Downloads\\Data_Immersion_Wrangling.ipynb'

In [21]:
df = pd.read_excel("sample_be_sales.xlsx")
df.head()

,Country:,Belgium,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5
0,Date modified:,2021-02-01 00:00:00,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN
3,order_id,date,product_id,product_name,price_per_kg,weight_kg
4,1,2021-01-01 00:00:00,7,Mango,51,4

In [22]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 104 entries, 0 to 103
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country:    102 non-null    object
 1   Belgium     102 non-null    object
 2   Unnamed: 2  101 non-null    object
 3   Unnamed: 3  101 non-null    object
 4   Unnamed: 4  101 non-null    object
 5   Unnamed: 5  101 non-null    object
dtypes: object(6)
memory usage: 5.0+ KB

In [23]:
df = df.iloc[3:].reset_index(drop=True)
df.columns = df.iloc[0]
df = df[1:].reset_index(drop=True)

In [22]:
print(list(df.columns))
df.head()

[11, datetime.datetime(2021, 1, 5, 0, 0), 8, 'Orange', 67, 7]

3  11  2021-01-05 00:00:00  8  Orange  67   7
0  12  2021-01-05 00:00:00  6  Grapes  41   4
1  13  2021-01-05 00:00:00  7   Mango  51   7
2  14  2021-01-05 00:00:00  5   Chico  69  10
3  15  2021-01-05 00:00:00  4  Cherry  41   3
4  16  2021-01-06 00:00:00  5   Chico  69   6

In [8]:
df.isnull().sum()

0
order_id        0
date            0
product_id      0
product_name    0
price_per_kg    0
weight_kg       0
dtype: int64

In [9]:
df.duplicated().sum()

0

In [10]:
df.dtypes

0
order_id        object
date            object
product_id      object
product_name    object
price_per_kg    object
weight_kg       object
dtype: object

df.describe()

In [18]:
df.head()

,order_id,date,product_id,product_name,price_per_kg,weight_kg,total_sales,year,month,day
0,1,2021-01-01,7,Mango,51,4,204,2021,1,1
1,2,2021-01-01,9,Pineapple,55,10,550,2021,1,1
2,3,2021-01-01,2,Avocado,33,4,132,2021,1,1
3,4,2021-01-02,10,Watermelon,35,4,140,2021,1,2
4,5,2021-01-03,3,Banana,39,7,273,2021,1,3

In [19]:
df.to_csv("final_clean_sales_data.csv", index=False)